<?php
ob_start();
$title="Словарь японских терминов";
?>

<h1>Словарь японских терминов</h1>
<hr>
<table class="table table-condensed table-striped">
    <tr>
        <th>Термин</th>
        <th>Японское написание</th>
        <th>Значение</th>
    </tr>
    <tr>
        <td>Агари</td>
        <td>和了、あがり</td>
        <td>Объявление победы в раздаче (рон или цумо)</td>
    </tr>
    <tr>
        <td>Анджун</td>
        <td>暗順、あんじゅん</td>
        <td>Закрытый сет из трех последовательных тайлов мастей (закрытое шунцу)</td>
    </tr>
    <tr>
        <td>Анкан</td>
        <td>暗槓、あんかん</td>
        <td>Объявленный закрытый кан (закрытое канцу)</td>
    </tr>
    <tr>
        <td>Анко</td>
        <td>暗刻、あんこう</td>
        <td>Закрытый сет из трех одинаковых тайлов (закрытое коцу). Анкан также является анко.</td>
    </tr>
    <tr>
        <td>Атамаханэ</td>
        <td>頭跳ね、あたまはね</td>
        <td>Правило, согласно которому при объявлении победы с одного и того же сброса более чем одним игроком, приоритет имеет игрок, сидящий первым по направлению хода от игрока, сбросившего тайл.</td>
    </tr>
    <tr>
        <td>Атодзуке</td>
        <td>後付け、あとづけ</td>
        <td>Правило, разрешающее объявлять победу в случае, если наличие яку в руке зависит от ожидания. Также используется для обозначения ситуации, когда наличие яку зависит от ожидания.</td>
    </tr>
    <tr>
        <td>Бетаори</td>
        <td>ベタ降り、べたおり</td>
        <td>Стратегия защиты, заключающаяся в сносе заведомо безопасных тайлов (например, гэнбуцу, невозможных ожиданий) путем разрушения имеющихся форм в руке.</td>
    </tr>
    <tr>
        <td>Гэнбуцу</td>
        <td>現物、げんぶつ</td>
        <td>Тайл, находящийся в дискарде игрока. На все гэнбуцу-тайлы у игрока фуритен.</td>
    </tr>
    <tr>
        <td>Даматен</td>
        <td>黙聴、だまてん</td>
        <td>Скрытый темпай на закрытой руке (без объявления риичи)</td>
    </tr>
    <tr>
        <td>Кабэ</td>
        <td>壁、かべ</td>
        <td>Техника защиты, использующая невозможность ожиданий в рянмен, пенчан и канчан при полностью видимых граничных тайлах.</td>
    </tr>
    <tr>
        <td>Камича</td>
        <td>上家、かみちゃ</td>
        <td>Игрок, сидящий слева.</td>
    </tr>
    <tr>
        <td>Канцу</td>
        <td>槓子、かんつ</td>
        <td>Четыре одинаковых тайла, объявленные как кан.</td>
    </tr>
    <tr>
        <td>Канчан</td>
        <td>嵌張、かんちゃん</td>
        <td>Внутреннее ожидание в шунцу, например 3-5</td>
    </tr>
    <tr>
        <td>Каратен</td>
        <td>空聴、からてん</td>
        <td>Пустое ожидание. Темпай, когда все завершающие руку тайлы уже вышли в дискард.</td>
    </tr>
    <tr>
        <td>Кимеучи</td>
        <td>決め打ち、きめうち</td>
        <td>Способ игры, при котором игрок с начала раздачи фиксируется на сборе конкретного яку и сбрасывает все неподходящие тайлы. В подавляющем большинстве случаев кимеучи неприемлемо.</td>
    </tr>
    <tr>
        <td>Ко</td>
        <td>子、こ</td>
        <td>Игрок, не являющийся оя (дилером) в текущей раздаче.</td>
    </tr>
    <tr>
        <td>Коцу</td>
        <td>刻子、こつ</td>
        <td>Три одинаковых тайла</td>
    </tr>
    <tr>
        <td>Куикаэ</td>
        <td>喰い替え、くいかえ</td>
        <td>Правило, запрещающее после объявления чи или пона снос такого же тайла, который был взят в чи/пон, а также тайла, которые мог дополнять это чи до взятия.</td>
    </tr>
    <tr>
        <td>Кюсюкюхай</td>
        <td>九種複数、きゅうしゅきゅはい</td>
        <td>Пересдача при наличии в стартовой руке 9 уникальных терминальных и благородных тайлов.</td>
    </tr>
    <tr>
        <td>Нобетан</td>
        <td>延べ単、のべたん</td>
        <td>Двойное ожидание в пару (танки), например 3-4-5-6.</td>
    </tr>
    <tr>
        <td>Оорасу</td>
        <td>オーラス</td>
        <td>Последний раунд игры</td>
    </tr>
    <tr>
        <td>Оя, дилер</td>
        <td>親、おや</td>
        <td>Раздающий игрок, игрок восточного ветра в текущей раздаче.</td>
    </tr>
    <tr>
        <td>Пайфу</td>
        <td>牌譜、ぱいふ</td>
        <td>Подробная запись игры с расшифровками.</td>
    </tr>
    <tr>
        <td>Пенчан</td>
        <td>辺張、ぺんちゃん</td>
        <td>Краевое ожидание в шунцу, например 1-2.</td>
    </tr>
    <tr>
        <td>Ренчан</td>
        <td>連荘、れんちゃん</td>
        <td>Дополнительная раздача, назначаемая при победе дилера и при ничьей.</td>
    </tr>
    <tr>
        <td>Риншанпай</td>
        <td>嶺上牌、りんしゃんぱい</td>
        <td>Тайл, который берется с мертвой стены при объявлении кана.</td>
    </tr>
    <tr>
        <td>Рянкан</td>
        <td>両嵌、りゃんかん</td>
        <td>Двойной канчан, двойное внутреннее ожидание, например 3-5-7.</td>
    </tr>
    <tr>
        <td>Рянмен</td>
        <td>両面、りゃんめん</td>
        <td>Двустороннее ожидание в шунцу, например 3-4.</td>
    </tr>
    <tr>
        <td>Рянханшибари</td>
        <td>二飜縛り、りゃんはんしばり</td>
        <td>Правило, согласно которому после 5й хонбы для победы требуется минимум 2 хан.</td>
    </tr>
    <tr>
        <td>Уке-ире</td>
        <td>受け入れ、うけいれ</td>
        <td>Количество и типы тайлов, которые способствуют уменьшению числа шантен в руке.</td>
    </tr>
    <tr>
        <td>Танки</td>
        <td>単騎、たんき</td>
        <td>Ожидание в пару.</td>
    </tr>
    <tr>
        <td>Темпай</td>
        <td>聴牌、テンパイ</td>
        <td>Состояние ожидания в победу, когда до победы не хватает единственного тайла.</td>
    </tr>
    <tr>
        <td>Тоймен</td>
        <td>対面、といめん</td>
        <td>Игрок, сидяющий напротив.</td>
    </tr>
    <tr>
        <td>Тойцу</td>
        <td>対子、といつ</td>
        <td>Пара одинаковых тайлов.</td>
    </tr>
    <tr>
        <td>Тонпуусен</td>
        <td>東風戦、とんぷうせん</td>
        <td>Игра, состоящая только из восточных раундов.</td>
    </tr>
    <tr>
        <td>Фуритен</td>
        <td>振聴、ふりてん</td>
        <td>Состояние игрока, когда любой из его выигрышных тайлов находится в его дискарде. Игрок является фуритен даже тогда, когда в дискарде лежит тайл, который не принес бы игроку ни одного яку в руке (в случае атодзуке).</td>
    </tr>
    <tr>
        <td>Ханчан</td>
        <td>半荘、はんちゃん</td>
        <td>Игра, состоящая из восточных и южных раундов.</td>
    </tr>
    <tr>
        <td>Хонба</td>
        <td>本場、ほんば</td>
        <td>Индикатор ренчана, обычно стоочковвая палочка.</td>
    </tr>
    <tr>
        <td>Цумо</td>
        <td>自摸、つも</td>
        <td>1) Победа взятием со стены; 2) Тайл, взятый со стены.</td>
    </tr>
    <tr>
        <td>Цумогири</td>
        <td>自摸切り、つもぎり</td>
        <td>Сброс тайла, только что пришедшего со стены.</td>
    </tr>
    <tr>
        <td>Шимоча</td>
        <td>下家、しもちゃ</td>
        <td>Игрок, сидяющий справа.</td>
    </tr>
    <tr>
        <td>Шанпон</td>
        <td>双ポン、しゃんぽん</td>
        <td>Ожидание в два пона, например 4-4 и 9-9.</td>
    </tr>
    <tr>
        <td>Шантен</td>
        <td>向聴、シャンテン</td>
        <td>Количество тайлов, которое необходимо заменить в руке, чтобы выйти в темпай.</td>
    </tr>
    <tr>
        <td>Шунцу</td>
        <td>順子、しゅんつ</td>
        <td>Три тайла одной масти, образующие последовательность.</td>
    </tr>
    <tr>
        <td>Якитори</td>
        <td>焼き鳥、やきとり</td>
        <td>1) Правило, согласно которому игрок, который не одержал ни одной победы в игре, выплачивает штраф. 2) Состояние игрока, который не одержал ни одной победы в игре.</td>
    </tr>
    <tr>
        <td colspan="3"><strong>Драконы и ветра</strong></td>
    </tr>
    <tr>
        <td>Чун</td>
        <td>中、ちゅん</td>
        <td>Красный дракон</td>
    </tr>
    <tr>
        <td>Хаку</td>
        <td>白、はく</td>
        <td>Белый дракон</td>
    </tr>
    <tr>
        <td>Хацу</td>
        <td>発、はつ</td>
        <td>Зеленый дракон</td>
    </tr>
    <tr>
        <td>Тон</td>
        <td>東、とん</td>
        <td>Восточный ветер (ひがし)</td>
    </tr>
    <tr>
        <td>Нан</td>
        <td>南、なん</td>
        <td>Южный ветер (みなみ)</td>
    </tr>
    <tr>
        <td>Ша</td>
        <td>西、しゃ</td>
        <td>Западный ветер (にし)</td>
    </tr>
    <tr>
        <td>Пей</td>
        <td>北、ぺい</td>
        <td>Северный ветер (きた)</td>
    </tr>
    <tr>
        <td colspan="3"><strong>Числа</strong></td>
    </tr>
    <tr>
        <td>Ии</td>
        <td>一、いい</td>
        <td>1 (いち)</td>
    </tr>
    <tr>
        <td>Рян</td>
        <td>二、りゃん</td>
        <td>2 (に)</td>
    </tr>
    <tr>
        <td>Сан</td>
        <td>三、さん</td>
        <td>3 (さん)</td>
    </tr>
    <tr>
        <td>Суу</td>
        <td>四、すう</td>
        <td>4 (し／よん)</td>
    </tr>
    <tr>
        <td>Уу</td>
        <td>五、うう</td>
        <td>5 (ご)</td>
    </tr>
    <tr>
        <td>Рюу</td>
        <td>六、りゅう</td>
        <td>6 (ろく)</td>
    </tr>
    <tr>
        <td>Чии</td>
        <td>七、ちい</td>
        <td>7 (しち／なな)</td>
    </tr>
    <tr>
        <td>Паа</td>
        <td>八、ぱあ</td>
        <td>8 (はち)</td>
    </tr>
    <tr>
        <td>Чуу</td>
        <td>九、ちゅう</td>
        <td>9 (きゅう)</td>
    </tr>
</table>
<div class="paragraph">
    Указанные выше числа используются в названиях некоторых яку, это можно использовать для лучшего запоминания. А именно:
    <ul>
        <li>В <strong>иипейко</strong> - ии = 1, аналогично в <strong>рянпейко</strong> рян = 2.</li>
        <li><strong>Чиитойцу</strong> = чии (7) + тойцу (пара) = 7 пар.</li>
        <li><strong>Сананко</strong> = сан (3) + анко (закрытый пон) = 3 закрытых пона. Аналогично <strong>сууанко</strong>, где суу = 4</li>
        <li>Аналогично <strong>санканцу</strong> (3 кана) и <strong>сууканцу</strong> (4 кана)</li>
        <li><strong>Чууренпото</strong> - 9 врат, чуу = 9</li>
        <li><strong>Пааренчан</strong> (правило) - здесь паа = 8.</li>
    </ul>
    Для каждого тайла масти из указанных цифр и наименования мастей (ман, пин, соу) формируются названия:
    <ul>
        <li><strong>Рянман</strong> - 2 символов</li>
        <li><strong>Сансоу</strong> - 3 бамбуков</li>
        <li><strong>Иипин</strong> - 1 точек</li>
        <li><strong>Ууман</strong> - 5 символов</li>
    </ul>
    Также цифры используются для формирования слов, обозначающих количество тайлов до темпая:
    <ul>
        <li><strong>Иишантен</strong> - 1 тайл до темпая</li>
        <li><strong>Ряншантен</strong> - 2 тайла до темпая</li>
        <li><strong>Саншантен</strong> - 3 тайла до темпая</li>
        <li><strong>Суушантен</strong> - 4 тайла до темпая</li>
        <li><strong>Уушантен</strong> - 5 тайлов до темпая</li>
    </ul>
</div>

<?php
$content = ob_get_clean();
include_once "layout.php";