<?php
ob_start();
$title="Базовые правила риичи-маджонга";
?>

<h1>Базовые правила риичи-маджонга</h1>
<hr>
    <div class="paragraph alert alert-success">
        Все сведения, данные ниже, являются основной и необходимой базой для успешной игры в риичи-маджонг.
        Существуют вариации правил стола, о которых сказано дополнительно. Для прочтения базовых правил желательно знание
        русскоязычной терминологии, которая дана в соответствующем разделе. В данном разделе для каждого русскоязычного термина указаны
        всплывающие пояснения для облегчения понимания. Термины, имеющие такие пояснения, подчеркнуты точечной линией.
    </div>
<hr>

<h2>Вступление</h2>
<hr>
<div class="paragraph">
    <strong>Ри&#x301;ичи-маджо&#x301;нг</strong> - азартная игра на четверых человек. Игра берет свое начало в Китае; существует множество различных правил игры
    в маджонг, в том числе китайские классические, китайские спортивные (MCR), тайваньские, американские. Риичи - модификация правил,
    изобретенная в Японии относительно недавно - во второй половине прошлого века. Риичи-маджонг содержит 27 условий победы,
    раздельные дискарды игроков, а также исключает использование тайлов цветов и сезонов. В этом разделе рассказывается о базовых
    правилах игры в риичи-маджонг, которые необходимо освоить любому начинающему игроку. Описываемые правила основаны на официальных правилах
    [[JPML|Japan Professional Mahjong League]] - японской профессиональной лиги маджонга.
</div>
<hr>
<h2>Игровой инвентарь</h2>
<div class="paragraph">
    Для игры используются 136 игровых фишек/костей, называемых <strong>тайлами</strong>. Тайлы можно поделить на виды согласно таблице:
</div>
<table class="table table-condensed table-striped">
    <tr>
        <td colspan="2"><strong>Тайлы мастей</strong></td>
    </tr>
    <tr>
        <td>Ман (символы) от 1 до 9:</td>
        <td>%%1man%%2man%%3man%%4man%%5man%%6man%%7man%%8man%%9man</td>
    </tr>
    <tr>
        <td>Пин (точки) от 1 до 9:</td>
        <td>%%1pin%%2pin%%3pin%%4pin%%5pin%%6pin%%7pin%%8pin%%9pin</td>
    </tr>
    <tr>
        <td>Соу (бамбуки) от 1 до 9:</td>
        <td>%%1sou%%2sou%%3sou%%4sou%%5sou%%6sou%%7sou%%8sou%%9sou</td>
    </tr>
    <tr>
        <td colspan="2"><strong>Благородные тайлы</strong></td>
    </tr>
    <tr>
        <td>Ветра (В-Ю-З-С):</td>
        <td>%%east%%south%%west%%north</td>
    </tr>
    <tr>
        <td>Драконы (красный-белый-зеленый):</td>
        <td>%%chun%%haku%%hatsu</td>
    </tr>
</table>
<div class="paragraph">
    Единицы и девятки тайлов мастей называются <strong>терминальными тайлами</strong>. Тайлы мастей от 2 до 8 включительно называются <strong>простыми тайлами</strong>.
    Каждого тайла в игре <strong>ровно 4 штуки</strong>. Всего видов тайлов - 34. Полный набор = 34 × 4 = 136 тайлов.
</div>
<div class="paragraph">
    Для подсчета очков используются счетные палочки:
</div>
<table class="table table-condensed table-striped">
    <tr>
        <td><img src="icons/10000.jpg"></td>
        <td>10000 очков</td>
    </tr>
    <tr>
        <td><img src="icons/5000.jpg"></td>
        <td>5000 очков</td>
    </tr>
    <tr>
        <td><img src="icons/1000.jpg"></td>
        <td>1000 очков</td>
    </tr>
    <tr>
        <td><img src="icons/100.jpg"></td>
        <td>100 очков</td>
    </tr>
</table>
<div class="paragraph">
    Каждому игроку в начале игры выдается базовое количество очков в размерах 30000.
    Обычно это одна палочка на 10000, две на 5000, девять на 1000 и десять на 100 очков.
</div>
<div class="paragraph">
    <strong>Цель игры</strong> - выиграть наибольшее количество очков. Очков в игре фиксированное количество, поэтому выиграть очки можно только получив их от другого игрока.
    Таким образом, в риичи-маджонге важно не только выигрывать очки, но и не проигрывать их.
</div>

<div class="paragraph">
    Также в игре используются:
    <ul>
        <li>Два шестигранных кубика</li>
        <li>Индикатор дилера - пластинка, на которой с двух сторон нанесены изображения восточного и южного ветров.</li>
    </ul>
</div>

<hr>
<h2>Ход игры</h2>
<hr>
<div class="paragraph">
    Игровая партия состоит из раундов, называемых по стороным света. Партия, состоящая из восточных и южных раундов, называется <strong>ханча&#x301;н</strong>;
    партия, состоящая только из восточных раундов, называется <strong>тонпуусе&#x301;н</strong>.
    О том, какие раунды играются, оговаривается явно в правилах стола, однако если это явно не указано, предполагается, что играется ханчан.
    В случае, если у кого-либо из игроков не остается очков, игра прерывается досрочно.
</div>
<div class="paragraph">
    Игра начинается с определения первого <strong>о&#x301;я (дилера)</strong> - раздающего игрока. Существует несколько способов определения дилера, рассмотрим самые распространенные:
    <ul>
        <li>На стол кладется четыре тайла различных ветров рубашкой вверх. Игроки вытягивают ветра, дилером становится игрок, вытянувший восточный ветер. Справа от него садится игрок, вытянувший юг, напротив - запад, слева - север.</li>
        <li>Каждый игрок бросает кубики один раз. Дилером становится игрок, у которого выпало наибольшее число на кубиках. Перераспределения игроков по местам относительно дилера в этом способе не происходит.</li>
    </ul>
    После указанных действий дилер кладет рядом с собой индикатор дилера - пластинку, на которой изображен восточный ветер с одной стороны и южный с другой.
    Пластинка кладется так, чтобы сверху был восточный ветер - этот ветер будет являться текущим <strong>ветром раунда</strong>. Когда в игре начинаются южные раунды, пластинка переворачивается.
</div>
<h3>Подготовка к раздаче</h3>
<div class="paragraph">
    Перед началом каждой раздачи игроки выкладывают тайлы на стол рубашкой вверх и тщательно их перемешивают. После этого игроки выстраивают на столе квадратную <strong>стену</strong> из тайлов,
    каждая сторона которой должна быть 17 тайлов в длину и 2 тайла в высоту:
    <div class="illustration"><img src="icons/wall.png" width="400"></div>
    Оя бросает кубики один раз и отсчитывает выпавшее на кубиках число <strong>против часовой стрелки</strong>, начиная с себя (см. схему):
    <div class="illustration"><img src="icons/wall-break.png" width="400"></div>
    За каждым игроком закрепляются собственные ветра согласно схеме. Ветер, закрепленный за игроком, называется его <strong>ветром места</strong>.
    Игрок, на которого укажет оя (в примере это игрок северного ветра), отсчитывает в своей части стены, начиная с правого края, <strong>то же самое выпавшее число</strong> и разделяет стену так,
    чтобы справа от разлома было число пар тайлов, соответствующее числу, выпавшему на кубиках, а слева - оставшаяся часть.
    <div class="illustration"><img src="icons/wall-break-2.png" width="600"></div>
    Разбор стены происходит <strong>по часовой стрелке</strong> начиная от разлома. Стена считается непрерывной и круговой, после окончания разбора одной стороны стены начинается разбор следующей ее стороны по часовой стрелке.
    Первый и последний тайлы стены указаны на рисунке. 7 пар тайлов с конца стены отделяются от основной стены, образуя <strong>мертвую стену</strong>. Эти 14 тайлов в разборе не участвуют, т.е. разбор стены оканчивается
    тогда, когда на столе не остается ни одного тайла из основной стены. В мертвой стене третий тайл слева переворачивается. При этом получается следующая картина:
    <div class="illustration"><img src="icons/wall-break-3.png" width="600"></div>
    После всех проделанных манипуляций начинается первичный разбор стены. Начиная с дилера и с последовательностью хода <strong>против часовой стрелки</strong> каждый игрок берет себе три раза по 4 тайла (стопку 2х2).
    После этого каждый берет 1 раз по одному тайлу (в последовательности сначала верхний, затем нижний), и наконец оя берет себе еще один тайл. На этом первоначальный разбор завершен.
    Взятые тайлы игроки выставляют на стол перед собой так, чтобы сам игрок видел значащие рисунки на тайлах, а его оппоненты видели только рубашки его тайлов. Набор тайлов у игрока называют его <strong>рукой</strong>.
    У оя-игрока на руке изначально 14 тайлов, у [[ко|игрок, не являющийся дилером в раздаче]]-игроков - по 13 тайлов.
</div>
<h3>Ход раздачи</h3>
<div class="paragraph">
    Ход игры состоит в последовательной замене тайлов в руке на другие тайлы, приходящие со стены. В порядке хода (против часовой стрелки) игроки берут со стены один тайл, после чего выбирают в своей руке самый ненужный тайл и сносят его в <strong>дискард</strong> -
    специальное место в центре стола. Дискард складывается слева направо, по 6 тайлов в ряд, в три ряда. Четвертый ряд обычно не начинают и при необходимости выкладывают седьмой и восьмой тайлы в третий ряд.
    На своем ходу игрок <strong>обязан</strong> взять один тайл (со стены либо [[с дискарда другого игрока|через объявление открытых сетов, см. далее]]) и сбросить один тайл в дискард (за исключением случая, когда взятый со стены тайл приносит игроку победу - в этом случае раздача заканчивается).
    Тайлы, уже сброшенные в дискард, не участвуют в игре и с них нельзя сделать [[объявлений|объявление победы или открытого сета, см. далее]]. Любые объявления можно делать исключительно с тайла, который на данный момент сбрасывается в дискард.
</div>
<div class="paragraph">
    Целью модификации собственной руки является сбор в ней сочетаний тайлов - <strong>сетов</strong>. В руке необходимо собрать <strong>четыре сета и одну пару</strong>. Сет может быть трех видов:
    <ul>
        <li>Три одинаковых тайла - <strong>ко&#x301;цу</strong>,</li>
        <li>Три последовательных тайла - <strong>шу&#x301;нцу</strong>, например 2-3-4, при этом последовательности можно собирать <strong>только из тайлов мастей</strong>,</li>
        <li>Четыре одинаковых тайла - <strong>ка&#x301;нцу</strong>.</li>
        <li>Пара, которая также обязана быть в руке, также называется <strong>то&#x301;йцу</strong>.</li>
    </ul>
</div>
<h3>Объявления открытых сетов</h3>
<div class="paragraph">
    Для ускорения сбора руки путем получения тайлов из чужого дискарда можно использовать <strong>объявления</strong>. В случае, если в руке есть два одинаковых тайла и кто-то сбрасывает третий, в этот момент можно громко сказать "<strong>Пон</strong>", после чего
    вскрыть пару своих тайлов, положить справа от руки, взять тайл из чужого дискарда и дополнить им пару так, чтобы получился сет. Игрок, взявший пон, должен сбросить лишний тайл, поскольку его рука должна вернуться к ожидающему состоянию.
    После этого ход переходит к игроку, следующему по направлению хода за игроком, взявшим пон. Пон можно взять с любого игрока, но только в момент его сброса. Взятый тайл кладется <strong>боком</strong> так, чтобы было понятно, с какого игрока был взят пон:
    <div class="hand">
        <div class="closed-part">
            %%5pin%%6pin%%7pin %%8man
        </div>
        %%haku-rotated%%haku%%haku %%8pin%%8pin-rotated%%8pin %%2sou%%2sou%%2sou-rotated
    </div>
    В примере выше белый дракон был взят с игрока слева, 8 [[пин|точек]] была взята с игрока напротив, а 2 [[соу|бамбуков]] - с игрока справа.
</div>
<div class="paragraph">
    Если в руке есть два последовательных тайла и игрок слева сбрасывает в дискард третий, в этот момент можно громко сказать "<strong>Чи</strong>", после чего вскрыть пару последовательных тайлов, положить их справа от руки, взять тайл из чужого дискарда
    и дополнить им пару так, чтобы получился сет. Игрок, взявший чи, должен сбросить лишний тайл, поскольку его рука должна вернуться к ожидающему состоянию. После этого ход переходит к игроку, следующему по направлению хода за игроком, взявшим чи.
    После взятия чи нельзя сбросить такой же тайл, какой был взят из чужого дискарда, либо тайл, дополнявший чи до закрытого [[шунцу|последовательность из трех тайлов мастей, например 3-4-5]] до взятия чи.
    Чи можно взять <strong>только с игрока слева</strong>. Тем не менее, взятый тайл кладется так, чтобы был понятно, что он взят с игрока слева:
    <div class="hand">
        <div class="closed-part">
            %%8man%%8man %%8pin%%8pin%%8pin %%3sou%%4sou
        </div>
        %%6pin-rotated%%5pin%%7pin %%haku-rotated%%haku%%haku
    </div>
    В случае, если два игрока одновременно сказали "чи" и "пон" на один и тот же тайл, приоритет имеет игрок, сказавший "пон".
</div>
<div class="paragraph">
    Рука, в которой есть открытые сеты, называется <strong>открытой</strong>. В большинстве случаев, открытая рука стоит дешевле закрытой, кроме того иногда с открытой рукой победить [[просто нельзя|Это происходит, если в руке нет яку - см. раздел про яку]].
    Модифицировать открытые части руки <strong>нельзя</strong>, т.е. запрещено осуществлять сброс и замену тайлов, которые находятся в открытых сетах.
</div>
<div class="paragraph">
    <strong>Канцу</strong> - особая форма, состоящая из четырех одинаковых тайлов. Канцу считается за один сет, но только в том случае, если он объявлен. В примере ниже кан не существует, поскольку он не объявлен:
    <div class="hand">
        <div class="closed-part">
            %%8man%%8man%%4pin%%4pin%%4pin%%4pin%%5pin%%6pin%%2sou%%3sou%%4sou%%east%%east
        </div>
    </div>
    Канцу может получиться в руке тремя способами. Оговорим отдельно каждый из них. Допустим, в нас есть указанная выше рука и мы хотим объявить кан четверок [[пин|точек]]. Для этого на своем ходу после взятия со стены мы громко говорим "<strong>Кан</strong>",
    после чего вскрываем все четыре тайла. Крайние два тайла с каждой стороны переворачиваем рубашкой вверх и выкладываем их справа от руки. Такая форма называется <strong>анкан</strong> или закрытый кан. Несмотря на то, что канцу выложен отдельно,
    рука, содержащая <strong>только</strong> закрытый кан, считается закрытой. В мертвой стене открывается новый верхний тайл, следующий за тайлом, открытым в самом начале раздачи. Далее, поскольку теперь в руке игрока недостаточно тайлов,
    он должен взять <strong>риншанпай</strong> - компенсирующий тайл из мертвой стены. После этого игрок совершает обычный сброс тайла в дискард и ход переходит дальше. Рука игрока после совершения описанных действий станет выглядеть следующим образом:
    <div class="hand">
        <div class="closed-part">
            %%8man%%8man%%9man %%5pin%%6pin %%2sou%%3sou%%4sou %%east%%east
        </div>
        %%closed%%4pin%%4pin%%closed
    </div>
    Второй способ получения канцу - путем объявления. В случае, если в руке есть <strong>[[анко|закрытый коцу, закрытый пон]]</strong>, а кто-либо сбрасывает четвертый тайл, можно громко сказать "Кан",
    после чего вскрыть [[коцу|три одинаковых тайла]], положить их справа от руки и дополнить взятым тайлом из чужого дискарда.
    <div class="hand">
        <div class="closed-part">
            %%5pin%%6pin%%7pin %%8man
        </div>
        %%haku-rotated%%haku%%haku%%haku %%8pin%%8pin%%8pin-rotated%%8pin %%2sou%%2sou%%2sou%%2sou-rotated
    </div>
    В примере выше белый дракон был взят с игрока слева, 8 [[пин|точек]] была взята с игрока напротив, а 2 [[соу|бамбуков]] - с игрока справа.
    После взятия кана точно так же требуется взять [[риншанпай|компенсирующий тайл из мертвой стены]] и совершить сброс в дискард. В случае открытого кана (который называется <strong>минкан</strong>) новый верхний тайл в мертвой стене открывается не сразу после объявления,
    а сразу после сброса, но до любых объявлений со сброшенного тайла.
</div>
<div class="paragraph">
    Третий и последний способ получения канцу заключается в возможности дополнения открытого [[коцу|три одинаковых тайла]] до канцу. Это можно сделать в том случае, если у игрока открыт пон и со стены заходит последний четвертый тайл. В этом случае
    игрок вправе громко сказать "Кан" и доложить взятый тайл к пону, после чего взять [[риншанпай|компенсирующий тайл из мертвой стены]] и совершить сброс в дискард. Точно так же после сброса открывается новый верхний тайл в мертвой стене.
    Рука после объявления доложенного кана может выглядеть следующим образом:
    <div class="hand">
        <div class="closed-part">
            %%5pin%%6pin%%7pin %%8man
        </div>
        %%haku-rotated-stacked-upper%%haku-rotated-stacked-lower%%haku%%haku %%8pin%%8pin-rotated-stacked-upper%%8pin-rotated-stacked-lower%%8pin %%2sou%%2sou%%2sou-rotated-stacked-upper%%2sou-rotated-stacked-lower
    </div>
    Непосредственно после того, как был доложен кан, и до того, как игрок взял риншанпай, любой другой игрок вправе объявить победу (<strong>чанкан</strong>) с доложенного тайла, если его ожидание включает этот тайл.
    Если в игре объявлено 4 канцу и после сброса на четвертом кане никто не выиграл, объявляется пересдача.
</div>
<div class="paragraph">
    Чи, пон и кан <strong>не могут быть объявлены</strong> на хотейпае - последнем сброшенном тайле в раздаче.
</div>
<h3>Объявление победы, ничья и пересдача</h3>
<div class="paragraph">    
    <strong>Выигрышная рука</strong> состоит из четырех сетов и пары; первая из двух основных целей игры - собрать выигрышную руку. <strong>Ожидающая рука</strong> - рука, которой не хватает одного тайла до победы.
    Состояние игрока, у которого рука ожидающая, называется <strong>темпай</strong>.
    В игре победа всегда объявляется игроком с ожидающей рукой с дополнительного тайла. Дополнительный тайл для победы может быть получен двумя способами:
    <ul>
        <li>Дополняющий тайл может быть взят со стены. Эта ситуация называется <strong>цумо&#x301;</strong>,</li>
        <li>Дополняющий тайл может быть взят с дискарда кого-либо из игроков. Эта ситуация называется <strong>рон</strong>.</li>
    </ul>
    При победе по рон, игрок, с дискарда которого была объявлена победа, единолично выплачивает победившему игроку [[некоторую сумму очков|Про подсчет очков написано в одноименном разделе]]. Если на один и тот же тайл были сделаны объявления "чи", "пон" и "рон",
    приоритет имеет объявление победы. Последовательность действий игрока при победе по рон:
    <ul>
        <li>При появлении в дискарде выигрышного тайла, громко вслух сказать "Рон".</li>
        <li>Взять выигрышный тайл из чужого дискарда и положить его <strong>перед рукой</strong>. Недопустимо вставлять выигрышный тайл в руку.</li>
        <li>Полностью открыть свою руку, чтобы остальные игроки могли проверить факт победы.</li>
        <li>Огласить количество очков, в которое оценивается рука.</li>
    </ul>
    При победе по цумо, победившему игроку платят все остальные игроки за столом. Последовательность действий точно такая же, за тем исключением, что тайл берется из стены, а не с чужого дискарда и при этом громко вслух говорится "Цумо".
</div>
<div class="paragraph">
    В случае, если никто из игроков не объявил победу до того момента, как стена оказалась полностью разобрана, объявляется <strong>ничья</strong>. При ничьей темпай-игроки открывают свои руки, чтобы остальные игроки могли проверить их темпай, после чего
    [[нотен|не являющиеся темпай]]-игроки выплачивают темпай-игрокам штраф. Общая сумма выплат по ничьей фиксирована и всегда равна <strong>3000</strong>. Таким образом, если 1 игрок темпай, то каждый из остальных игроков платит ему по 1000, если
    2 игрока темпай, то оставшиеся 2 игрока платят им по 1500 каждый, а если 3 игрока темпай, то оставшийся игрок платит каждому по 1000. Если все игроки темпай или все игроки [[нотен|не являющиеся темпай]], выплат по ничьей не производится.
</div>
<div class="paragraph">
    В случае, если победил оя, либо при ничьей оя остался темпай, назначается <strong>ренчан</strong> - дополнительная раздача. За каждый ренчан на индикатор дилера кладется одна палочка номиналом в 100 очков, которая называется <strong>хонба</strong>.
    В победах в каждой последующей раздаче за каждую хонбу к основной сумме выплат добавляется 300 очков. В случае победы по рон, выплаты по хонбе ложатся на проигравшего игрока, в случае же цумо выплаты делятся поровну между оставшимися тремя игроками.
</div>
<div class="paragraph">
    При победе [[ко|игрок, не являющийся оя/дилером]]-игрока <strong>хонба сбрасывается до нуля</strong> и индикатор дилера переходит следующему игроку по направлению хода (против часовой стрелки). С этой минуты игрок справа становится новым оя. В случае,
    если при ничьей оя остался [[нотен|не являющийся темпай]], индикатор также переходит по направлению хода, но <strong>хонба не сбрасывается</strong>, а увеличивается на 1. Когда каждый игрок побывал дилером по одному разу (неважно сколько ренчанов при этом состоялось),
    при следующей смене дилера индикатор переворачивается и начинаются южные раунды. Когда каждый игрок побывал дилером в южных раундах, игра завершается и подсчитываются очки.
</div>
<div class="paragraph">
    В ряде случаев раздача может быть прервана досрочно и назначена <strong>пересдача</strong>. Пересдача считается ренчаном (докладывается счетчик хонбы). Пересдача назначается в следующих случаях:
    <ul>
        <li>Если в первом круге сдачи все игроки сбросили фишки одного ветра.</li>
        <li>Игрок может объявить пересдачу при своём первом взятии со стены, если у него на руке есть минимум девять разных терминальных или благородных тайлов. При этом до его хода никто не должен был объявлять чи, пон или кан.
            Эта пересдача носит название <strong>кюсюкюхай</strong>.</li>
        <li>После объявления четвертого кана. Пересдача происходит, если каны принадлежат разным игрокам, а в момент объявления четвертого кана никто не объявил победу. Однако, если один человек объявил четыре кана,
            то игра продолжается, но остальные игроки не могут объявить пятый кан.</li>
        <li>Победа троих. Ситуация,  когда три игрока объявляют победу на одном и том же тайле, сброшенным четвёртым игроком.</li>
        <li>Четыре [[риичи|про риичи рассказано далее, в разделе "Яку и хан"]]. Происходит при объявлении четвертого риичи, если никто не объявил рон на сброшенный тайл.</li>
    </ul>
</div>
<h3>Яку и хан</h3>
<div class="paragraph">
    Наличие выигрышной руки является необходимым, но не достаточным условием возможности объявления победы. Вторым условием, которое должно быть выполнено,
    является наличие в руке игрока как минимум одного <strong>яку</strong> - особого ценного условия. Полный список яку можно посмотреть в <a href="yaku-list.php">одноименном разделе</a>,
    здесь же мы ограничимся рассмотрением комбинационных яку и риичи.
</div>
<div class="paragraph">
    Яку измеримы и некоторые яку дороже других. Стоимость яку измеряют в единицах, которые называются <strong>хан</strong>. Рассмотрим одно из самых популярных яку - <strong>якуха&#x301;й</strong>.
</div>
<div class="paragraph">
    Якухай - [[коцу|три одинаковых тайла]] или [[канцу|четыре одинаковых тайла]] тайлов драконов, ветров места или ветров раунда.
    Якухай стоит 1 хан. Если собран якухай ветра раунда, который одновременно является ветром места, такой якухай является двойным и стоит соответственно 2 хан.
    Пример выигрышной руки, в которой собран якухай зеленых драконов:
    <div class="hand">
        <div class="closed-part">
            %%5pin%%6pin%%7pin %%1sou%%2sou%%3sou %%9pin%%9pin
        </div>
        %%hatsu%%hatsu%%hatsu-rotated %%8man%%8man-rotated%%8man
    </div>
    В руке может быть собрано более одного якухая, в этом случае их стоимость суммируется. Обычно якухай - самая распространенная причина раннего открытия руки.
</div>
<div class="paragraph">
    Есть несколько яку, которые <strong>работают только на закрытой руке</strong>, также есть несколько яку, стоимость которых на открытой руке меньше, чем стоимость на закрытой. Пример:
    <div class="hand">
        <div class="closed-part">
            %%5pin%%6pin%%7pin %%1sou%%2sou%%3sou %%9pin%%9pin %%5pin%%6pin%%7pin %%7man%%8man%%9man
        </div>
    </div>
    В данной руке есть яку <strong>иипе&#x301;йко</strong>, которое заключается в том, что в руке есть два одинаковых [[шунцу|три последовательных тайла одной масти]]. Иипейко работает <strong>только на закрытой руке</strong>.
</div>
<div class="paragraph">
    Бывает такое, что при закрытой руке никак не складывается никакое яку, и нет даже намека на победу. Возьмем например следующую руку:
    <div class="hand">
        <div class="closed-part">
            %%5pin%%6pin%%7pin %%1sou%%1sou%%1sou %%9pin%%9pin %%4sou%%5sou%%6sou %%8man%%9man
        </div>
    </div>
    Эта рука является ожидающей, но в ней не только нет ни одного яку, но нет и никакой перспектипы это яку получить в процессе модификации. И в этом случае к нам приходит на помощь особое яку японского маджонга,
    из-за которого он и получил свое название - <strong>ри&#x301;ичи</strong>. Риичи - это игровое условие, а не комбинация тайлов внутри руки, но это игровое условие является яку, которое стоит 1 хан.
    Риичи можно объявить при условии темпая на закрытой руке. Для этого игрок на своем ходу громко говорит "Риичи", сбрасывает в дискард лишний тайл, поворачивая его боком, и делает ставку в размере 1000 очков.
    Ставка кладется на стол перед дискардом игрока. После объявления риичи игрок <strong>не вправе модифицировать руку</strong>. Это плата за получение возможности победить.
    Другими словами, теперь каждый взятый со стены тайл обязан быть снесен в дискард, если он не дает победы, даже если этот тайл является очевидно выигрышным кому-либо другому.
</div>
<div class="paragraph">
    Риичи не может быть объявлен позднее, чем за 4 тайла до конца стены. Запомнить можно так: после объявления риичи у игрока должна быть возможность взять тайл со стены в случае, если ход в дальнейшем не будет прерван никакими объявлениями.
</div>
<h3>Дора</h3>
<div class="paragraph">
    В игре существуют так называемые тайлы <strong>до&#x301;ра</strong> - бонусные тайлы, каждый из которых увеличивает стоимость руки на 1 хан. <strong>Дора не дает яку</strong>. При начальном разборе стены в мертвой стене переворачивается единственный верхний тайл.
    Этот тайл играет роль <strong>указателя доры</strong>. Дорой является тайл, следующий по порядку за тем тайлом, который указан в индикаторе. Например, если в индикаторе 5 [[ман|символов]], то шестерка ман будет дорой.
    Последовательности замкнуты:
    <ul>
        <li>1 &rarr; 2 &rarr; 3 &rarr; 4 &rarr; 5 &rarr; 6 &rarr; 7 &rarr; 8 &rarr; 9 &rarr; 1</li>
        <li>[[чун|красный дракон]]  &rarr; [[хаку|белый дракон]] &rarr; [[хацу|зеленый дракон]] &rarr; [[чун|красный дракон]]</li>
        <li>восток &rarr; юг &rarr; запад &rarr; север &rarr; восток</li>
    </ul>
    Каждый раз при взятии кана, открывается новый указатель доры. Таким образом, дор в игре становится не 4, а 8. Больше канов - больше дор. Дора, полученная открытием нового указателя после кана, называется <strong>кандорой</strong>.
</div>
<div class="paragraph">
    В случае выгрыша при объявлении риичи, помимо верхних указателей доры, смотрятся еще и нижние указатели - те тайлы, которые лежат непосредственно под открытыми верхними указателями доры. Доры, полученные открытием нижнего указателя,
    называются <strong>урадо&#x301;рами</strong>, либо если нижний указатель находится под указателем кандоры - <strong>кан-урадо&#x301;рами</strong>. Таким образом, за каждый кан в игру добавляется четыре кандоры и четыре кан-урадоры.
</div>
<div class="paragraph">
    В некоторых правилах стола предусмотрена замена пятерок мастей на аналогичные пятерки, но окрашенные в ярко-красный цвет. Эти красные пятерки называются <strong>акадо&#x301;рами</strong> и являются дорами сами по себе независимо от того, какой тайл
    лежит в указателе доры. Если в указателе лежит четверка какой-либо масти, то акадора этой масти одновременно является и дорой, и акадорой, поэтому увеличивает стоимость руки не на 1, а на 2 хан.
</div>
<h3>Фуритен</h3>
<div class="paragraph">
    В японском маджонге существует правило <strong>фурите&#x301;н</strong>, которое гласит, что игрок лишается возможности победить по рон, если любой из его
    выигрышных тайлов находится в его дискарде. Поэтому это правило также иногда называют "Правилом упущенного дискарда". Победа при фуритене допустима только со стены, т.е. по цумо.
</div>
<div class="paragraph">
    Правило фуритен дает важную составляющую игры, а именно - возможность игры в защиту. Если какой-то игрок объявил риичи, можно смело сбрасывать любые тайлы из тех, что лежат у него в дискарде, если таковые конечно имеются в нашей руке.
    Выиграть с них он не сможет, а в случае попытки объявить победу при фуритене - это будет засчитано как неправильное объявление победы с последующим штрафом.
</div>
<div class="paragraph">
    Также именно правилом фуритен объясняется необходимость класть взятые тайлы в открытые сеты так, чтобы было понятно, с каких игроков они были взяты. Следует относиться к этому крайне внимательно, иначе можно получить штраф из-за ошибки другого игрока.
</div>
<h3>Временный фуритен</h3>
<div class="paragraph">
    Также существует так называемое правило <strong>вре&#x301;менного фуритена</strong>, которое запрещает победу по рон, если на этом же круге была возможность объявить победу, но игрок ей не воспользовался.
    Например, если мы побеждаем с 2 и 5 пин, правый игрок в свой ход сбросил 2 пин, но мы не объявили победу, игроки напротив и слева могут свободно сбрасывать 2 и 5 пин <strong>на этом круге</strong>, поскольку мы не сможем с них победить
    из-за временного фуритена. Это дает важную тактику защиты - если сбрасывать тайл, который только что был сброшен игроком слева, с этого тайла не сможет победить никто в силу фуритена и временного фуритена.
</div>
<div class="paragraph">
    Временный фуритен длится до момента, когда <strong>игрок может формально сменить ожидание</strong>, то есть до взятия игроком тайла со стены. В принципе, игрок может и не менять ожидание, но ключевое слово здесь - <strong>формально</strong>, и вот почему:
    в случае, если игрок обявил риичи, он не может менять свое ожидание. В этом случае пропущенный победный тайл дает ему временный фуритен, который длится до конца раздачи, поскольку игрок не может сменить ожидание даже формально.
    Разумеется, в случае "вечного" временного фуритена возможна победа по цумо.
</div>
<h2>Подсчет очков</h2>
<div class="paragraph">
    Подсчет очков сводится к подсчету количества хан, которые даются за яку и доры, и к подсчету миниочков <strong>фу</strong>, которые даются за выполнение некоторых условий в руке. Для подсчета количества хан следует посмотреть список яку,
    просуммировать количество хан по всем найденным яку и добавить к ним количество хан по дорам - по одному за каждую дору, акадору, кандору, урадору, кан-урадору. Миниочки фу подсчитываются по следующим правилам:
    <ul>
        <li>Базовое число фу: 20. Меньше этого не может быть.</li>
        <li>Победа по цумо: +2 фу. Не учитываются при пинфу и риншан кайхо.</li>
        <li>Победа по рон при закрытой руке: +10 фу.</li>
        <li>Ожидание на победу в [[танки|ожидание в пару]], [[канчан|внутреннее ожидание в шунцу, например 3-5]] или [[пенчан|краевое ожидание в шунцу, например 1-2]]: +2 фу.</li>
        <li>Пара, состоящая из якухайных тайлов: +2 фу. Если пара состоит из ветра раунда, одновременно являющегося ветром места: +4 фу.</li>
        <li>За [[коцу|три одинаковых тайла]] и [[канцу|четыре объявленных одинаковых тайла]] согласно таблице:
            <table class="table table-condensed table-striped">
                <tr>
                    <th></th>
                    <th>[[Коцу|три одинаковых тайла]] [[простых|тайлы мастей от 2 до 8]] тайлов</th>
                    <th>[[Коцу|три одинаковых тайла]] [[терминальных|единицы и девятки мастей]] или [[благородных|ветра и драконы]] тайлов</th>
                    <th>[[Канцу|четыре объявленных одинаковых тайла]] [[простых|тайлы мастей от 2 до 8]] тайлов</th>
                    <th>[[Канцу|четыре объявленных одинаковых тайла]] [[терминальных|единицы и девятки мастей]] или [[благородных|ветра и драконы]] тайлов</th>
                </tr>
                <tr>
                    <th>Открытый</th>
                    <td>+2 фу</td>
                    <td>+4 фу</td>
                    <td>+8 фу</td>
                    <td>+16 фу</td>
                </tr>
                <tr>
                    <th>Закрытый</th>
                    <td>+4 фу</td>
                    <td>+8 фу</td>
                    <td>+16 фу</td>
                    <td>+32 фу</td>
                </tr>
            </table>
        </li>
    </ul>
    В случае ожидания в [[шанпон|ожидание в два пона, состоящее из двух пар, каждая их которых может стать коцу]] при победе по рон, полученное коцу считается <strong>открытым</strong> и миниочки для него считаются соответственно.
    В том же случае, но при победе по цумо, полученное коцу считается <strong>закрытым</strong>.
    После подсчета миниочки фу округляются вверх до десятков. После этого требуется посмотреть в таблицу выплат, где в зависимости от количества хан и фу определить требуемые выплаты.
</div>
<div class="paragraph">
    Существуют два особых яку, которые не состоят из четырех сетов и пары:
    <ul>
        <li><strong>Кокушимусо</strong> - комбинация из 13ти тайлов, по одной единице и девятке каждой масти, по одному ветру и дракону + пара к любому из 13ти тайлов. Кокушимусо стоит <strong>якуман</strong>.</li>
        <li><strong>Чиитойцу</strong> - комбинация из семи пар любых тайлов. Чиитойцу стоит 2 хан и имеет <strong>фиксированное количество фу, равное 25</strong>.</li>
    </ul>
</div>
<h2>Нарушения правил</h2>
<div class="paragraph">
    Ну и наконец ложка дегтя: существуют определенные штрафы за нарушения правил, независимо от того, было ли нарушение преднамеренным или случайным.
    <ul>
        <li><strong>Чомбо</strong> - штраф стоимостью в манган, выплачиваемый игроком за грубое нарушение правил, не позволяющее продолжить сдачу. При чомбо дилер остается на месте, риичи депозиты возвращаются,
            хонба не добавляется, т.е. ситуация должна вернуться на состояние в начале сдачи.</li>
        <li><strong>Мертвая рука</strong> - состояние игрока, при котором он не имеет права делать никаких объявлений, при ничьей он считается нотен. Если игрок с мертвой рукой
            объявляет пон, чи, кан или победу, то он наказывается чомбо.</li>
    </ul>

    Следующие действия наказываются чомбо:
    <ul>
        <li><strong>[[Нотен|в случае отсутствия ожидающей руки (темпая)]] риичи</strong>, назначается в случае ничьей.</li>
        <li><strong>Ошибочное объявление победы</strong>, применяется в случае объявления победы и полного открытия не имеющей выигрыша руки. Ошибочное объявление победы имеет больший приоритет, чем объявления открытых сетов,
            но меньший, чем правильное объявление победы, т.е. если на один и тот же тайл было сделано два объявления победы, и одно из них было ошибочным, засчитывается второе объявление и к первому штраф чомбо <strong>не применяется</strong>.</li>
        <li><strong>Объявление кана, меняющего ожидание при риичи</strong>, назначается в случае ничьей или победы игрока объявившего такой кан.</li>
        <li>Если по вине игрока текущую раздачу <strong>невозможно продолжать</strong>.</li>
    </ul>
    Следующие ситуации караются мертвой рукой:
    <ul>
        <li>Взятие тайла из стены вне очереди, пропуск хода или неправильное взятие.</li>
        <li>Ошибочное объявление чи, пона, кана (в этом случае взятый тайл возвращается обратно в дискард), либо объявление чи не в свой ход.</li>
        <li>Неправильное количество тайлов в руке (более или менее 13 тайлов + 1 за каждый объявленный кан).</li>
        <li>Подсматривание тайлов из мертвой стены или рук других игроков.</li>
    </ul>
</div>



<?php
$content = ob_get_clean();
include_once "layout.php";